maorshutman/tm4c123g-quadrotor/flight_controller/main.c
    ui32CompDCMStarted = 0;
}

//*****************************************************************************
//
// Measures gyroscope bias.
//
//*****************************************************************************
void
CalibrateIMU(float * biasWx, float * biasWy, float * biasWz,
             float * biasAx, float * biasAy, float * biasAz)
{
    float gyro[3];
    float accel[3];
    float gyroBias[3] = {};
    float accelBias[3] = {};
    int i;
    for (i = 0; i < GYRO_BIAS_SAMPLES; i++)
    {
        while(!g_vui8I2CDoneFlag)
        {
            ROM_SysCtlSleep();
        }

        //
        // Clear the flag
        //
        g_vui8I2CDoneFlag = 0;

        //
        // Get floating point version of angular velocities in rad/sec
        //
        MPU9150DataGyroGetFloat(&g_sMPU9150Inst, gyro, gyro + 1,
                                gyro + 2);

        //
        // Get floating point version of acceleration in m/sec^2
        //
        MPU9150DataAccelGetFloat(&g_sMPU9150Inst, accel, accel + 1,
                                accel + 2);

        gyroBias[0] += gyro[0];
        gyroBias[1] += gyro[1];
        gyroBias[2] += gyro[2];
        accelBias[0] += accel[0];
        accelBias[1] += accel[1];
        accelBias[2] += accel[2];
    }

    *biasWx = gyroBias[0] / GYRO_BIAS_SAMPLES;
    *biasWy = gyroBias[1] / GYRO_BIAS_SAMPLES;
    *biasWz = gyroBias[2] / GYRO_BIAS_SAMPLES;
    *biasAx = accelBias[0] / GYRO_BIAS_SAMPLES;
    *biasAy = accelBias[1] / GYRO_BIAS_SAMPLES;
    *biasAz = accelBias[2] / GYRO_BIAS_SAMPLES - 9.81;
}

//*****************************************************************************
//
// Main application entry point.
//
//*****************************************************************************
int
main(void)
{
    //
    // Setup the system clock to run at 40 Mhz from PLL with crystal reference
    //
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_5 | SYSCTL_USE_PLL | SYSCTL_XTAL_16MHZ |
                       SYSCTL_OSC_MAIN);
    ROM_SysCtlPWMClockSet(SYSCTL_PWMDIV_64);

    //
    // Initialize PWM.
    //
    InitPWM(&g_sPWMInst);

    //
    // Calibrates throttle.
    //
    CalibrateThrottle(&g_sPWMInst);

    //
    // Initialize UART for radio receiver.
    //
    InitHC12UART();

    //
    // Configures mpu6050 module and UART for display.
    //
    ConfigureMPU6050();

    //
    // Measures gyroscope bias.
    //
    CalibrateIMU(g_sCompDCMInst.fGyroBias, g_sCompDCMInst.fGyroBias + 1, g_sCompDCMInst.fGyroBias + 2,
                 g_sCompDCMInst.fAccelBias, g_sCompDCMInst.fAccelBias + 1, g_sCompDCMInst.fAccelBias + 2);

    //
    // Initialize PD controller for hovering.
    //
    InitPDController(&g_sPDControllerInst);

    // DEBUGGING
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_4);

    //
    // Main loop.
    //
    while(1)
    {
        //
        // Reads IMU data.
        //

        //
        // Go to sleep mode while waiting for data ready.
        //
        while(!g_vui8I2CDoneFlag)
        {
            ROM_SysCtlSleep();
        }

        //
        // Clears the flag.
        //
        g_vui8I2CDoneFlag = 0;

        //
        // Get floating point version of the Accel Data in m/s^2.
        //
        MPU9150DataAccelGetFloat(&g_sMPU9150Inst, pfAccel, pfAccel + 1,
                                 pfAccel + 2);

        //
        // Get floating point version of angular velocities in rad/sec
        //
        MPU9150DataGyroGetFloat(&g_sMPU9150Inst, pfGyro, pfGyro + 1,
                                pfGyro + 2);

        //
        // Get floating point version of magnetic fields strength in tesla
        //
        MPU9150DataMagnetoGetFloat(&g_sMPU9150Inst, pfMag, pfMag + 1,
                                   pfMag + 2);

        //
        // Check if this is our first data ever.
        //
        if(ui32CompDCMStarted == 0)
        {
            //
            // Set flag indicating that DCM is started.
            // Perform the seeding of the DCM with the first data set.
            //
            ui32CompDCMStarted = 1;
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, pfGyro[0], pfGyro[1],
                              pfGyro[2]);
            CompDCMStart(&g_sCompDCMInst);
        }
        else
        {
            //
            // DCM Is already started.  Perform the incremental update.
            //
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, pfGyro[0], pfGyro[1],
                              pfGyro[2]);
            CompDCMUpdate(&g_sCompDCMInst);
        }

        //
        // Increment the skip counter.  Skip counter is used so we do not
        // overflow the UART with data.
        //
        g_ui32PrintSkipCounter++;
        if(g_ui32PrintSkipCounter >= PRINT_SKIP_COUNT)
        {
            //
            // Reset skip counter.
            //
            g_ui32PrintSkipCounter = 0;

            //
            // Get Euler data. (Roll Pitch Yaw)
            //
            CompDCMComputeEulers(&g_sCompDCMInst, pfEulers, pfEulers + 1,
                                 pfEulers + 2);

            //
            // Get Quaternions.
            //
            CompDCMComputeQuaternion(&g_sCompDCMInst, pfQuaternion);

            //
            // convert mag data to micro-tesla for better human interpretation.
            //
            pfMag[0] *= 1e6;
            pfMag[1] *= 1e6;
            pfMag[2] *= 1e6;

            //
            // Convert Eulers to degrees. 180/PI = 57.29...
            // Convert Yaw to 0 to 360 to approximate compass headings.

            pfEulers[0] *= 57.295779513082320876798154814105f;
            pfEulers[1] *= 57.295779513082320876798154814105f;
            pfEulers[2] *= 57.295779513082320876798154814105f;
            if(pfEulers[2] < 0)
            {
                pfEulers[2] += 360.0f;
            }

            //
            // Calibrated accel. data
            //
            pfAccel[0] = g_sCompDCMInst.pfAccel[0];
            pfAccel[1] = g_sCompDCMInst.pfAccel[1];
            pfAccel[2] = g_sCompDCMInst.pfAccel[2];

            //
            // Now drop back to using the data as a single array for the
            // purpose of decomposing the float into a integer part and a
            // fraction (decimal) part.
            //
            for(ui32Idx = 0; ui32Idx < 16; ui32Idx++)
            {
                //
                // Convert float value to a integer truncating the decimal part.
                //
                i32IPart[ui32Idx] = (int32_t) (pfData[ui32Idx]);

                //
                // Multiply by 1000 to preserve first three decimal values.
                // Truncates at the 3rd decimal place.
                //
                i32FPart[ui32Idx] = (int32_t) (pfData[ui32Idx] * 1000.0f);

                //
                // Subtract off the integer part from this newly formed decimal
                // part.
                //
                i32FPart[ui32Idx] = i32FPart[ui32Idx] -
                        (i32IPart[ui32Idx] * 1000);

                //
                // make the decimal part a positive number for display.
                //
                if(i32FPart[ui32Idx] < 0)
                {
                    i32FPart[ui32Idx] *= -1;
                }
            }

            //
            // Print the acceleration numbers in the table.
            //
            UARTprintf("\033[5;17H%3d.%03d", i32IPart[0], i32FPart[0]);
            UARTprintf("\033[5;40H%3d.%03d", i32IPart[1], i32FPart[1]);
            UARTprintf("\033[5;63H%3d.%03d", i32IPart[2], i32FPart[2]);

            //
            // Print the angular velocities in the table.
            //
            UARTprintf("\033[7;17H%3d.%03d", i32IPart[3], i32FPart[3]);
            UARTprintf("\033[7;40H%3d.%03d", i32IPart[4], i32FPart[4]);
            UARTprintf("\033[7;63H%3d.%03d", i32IPart[5], i32FPart[5]);

            //
            // Print the magnetic data in the table.
            //
            UARTprintf("\033[9;17H%3d.%03d", i32IPart[6], i32FPart[6]);
            UARTprintf("\033[9;40H%3d.%03d", i32IPart[7], i32FPart[7]);
            UARTprintf("\033[9;63H%3d.%03d", i32IPart[8], i32FPart[8]);

            //
            // Print the Eulers in a table.
            //
            UARTprintf("\033[14;17H%3d.%03d", i32IPart[9], i32FPart[9]);
            UARTprintf("\033[14;40H%3d.%03d", i32IPart[10], i32FPart[10]);
            UARTprintf("\033[14;63H%3d.%03d", i32IPart[11], i32FPart[11]);

            //
            // Print the quaternions in a table format.
            //
            UARTprintf("\033[19;14H%3d.%03d", i32IPart[12], i32FPart[12]);
            UARTprintf("\033[19;32H%3d.%03d", i32IPart[13], i32FPart[13]);
            UARTprintf("\033[19;50H%3d.%03d", i32IPart[14], i32FPart[14]);
            UARTprintf("\033[19;68H%3d.%03d", i32IPart[15], i32FPart[15]);
        }

        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_4, 0x10);
        //
        // Reads desired state via UART2 buffer.
        //
        ReadDesiredState(&g_sPDControllerInst, &g_sPWMInst);

        //
        // PD controller.
        //
        ErrorToInput(&g_sPDControllerInst, &g_sCompDCMInst);
        PDContUpdatePWM(&g_sPDControllerInst, &g_sPWMInst);
        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_4, 0x0);
    }

    return 0;
}
